<template>
  <div class="layout">
    <h3 class="layout__title">绑定单个布尔值</h3>
    <div>
      <div>
        买衣服送袜子
        <k-checkbox v-model="b"></k-checkbox>
        {{b}}
        <div>

        </div>
      </div>
    </div>
    <h3 class="layout__title">绑定多个到数组</h3>
    <div>
      <div>
        <k-checkbox v-model="all"></k-checkbox>
        全选
        <div v-for="item in data"
          :key="item.Code">
          <label class="col-center">
            <k-checkbox type="arr"
              :data-arr.sync="selectedCode"
              :value="item.Code"></k-checkbox><span>&nbsp;{{item.Name}}</span>
          </label>
          <div>
            <label class="col-center"
              v-for="obj in item.Childs"
              :key="obj.Code">
              <k-checkbox type="arr"
                :data-arr.sync="selectedCityCode"
                :value="obj.Code"></k-checkbox><span>&nbsp;{{obj.Name}}</span>
            </label>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      b: true,
      all: false,
      data: [
        {
          "Code": 110000000000,
          "PCode": 0,
          "Name": "北京市",
          "Childs": [
            {
              "Code": 110100000000,
              "Name": "直辖区",
              "PCode": 110000000000
            }
          ]
        },
        {
          "Code": 120000000000,
          "PCode": 0,
          "Name": "天津市",
          "Childs": [
            {
              "Code": 120100000000,
              "Name": "直辖区",
              "PCode": 120000000000
            }
          ]
        },
        {
          "Code": 130000000000,
          "PCode": 0,
          "Name": "河北省",
          "Childs": [
            {
              "Code": 130100000000,
              "Name": "石家庄市",
              "PCode": 130000000000
            },
            {
              "Code": 130200000000,
              "Name": "唐山市",
              "PCode": 130000000000
            },
            {
              "Code": 130300000000,
              "Name": "秦皇岛市",
              "PCode": 130000000000
            },
            {
              "Code": 130400000000,
              "Name": "邯郸市",
              "PCode": 130000000000
            },
            {
              "Code": 130500000000,
              "Name": "邢台市",
              "PCode": 130000000000
            },
            {
              "Code": 130600000000,
              "Name": "保定市",
              "PCode": 130000000000
            },
            {
              "Code": 130700000000,
              "Name": "张家口市",
              "PCode": 130000000000
            },
            {
              "Code": 130800000000,
              "Name": "承德市",
              "PCode": 130000000000
            },
            {
              "Code": 130900000000,
              "Name": "沧州市",
              "PCode": 130000000000
            },
            {
              "Code": 131000000000,
              "Name": "廊坊市",
              "PCode": 130000000000
            },
            {
              "Code": 131100000000,
              "Name": "衡水市",
              "PCode": 130000000000
            },
            {
              "Code": 139000000000,
              "Name": "直辖县",
              "PCode": 130000000000
            }
          ]
        },
        {
          "Code": 140000000000,
          "PCode": 0,
          "Name": "山西省",
          "Childs": [
            {
              "Code": 140100000000,
              "Name": "太原市",
              "PCode": 140000000000
            },
            {
              "Code": 140200000000,
              "Name": "大同市",
              "PCode": 140000000000
            },
            {
              "Code": 140300000000,
              "Name": "阳泉市",
              "PCode": 140000000000
            },
            {
              "Code": 140400000000,
              "Name": "长治市",
              "PCode": 140000000000
            },
            {
              "Code": 140500000000,
              "Name": "晋城市",
              "PCode": 140000000000
            },
            {
              "Code": 140600000000,
              "Name": "朔州市",
              "PCode": 140000000000
            },
            {
              "Code": 140700000000,
              "Name": "晋中市",
              "PCode": 140000000000
            },
            {
              "Code": 140800000000,
              "Name": "运城市",
              "PCode": 140000000000
            },
            {
              "Code": 140900000000,
              "Name": "忻州市",
              "PCode": 140000000000
            },
            {
              "Code": 141000000000,
              "Name": "临汾市",
              "PCode": 140000000000
            },
            {
              "Code": 141100000000,
              "Name": "吕梁市",
              "PCode": 140000000000
            }
          ]
        },
        {
          "Code": 150000000000,
          "PCode": 0,
          "Name": "内蒙古自治区",
          "Childs": [
            {
              "Code": 150100000000,
              "Name": "呼和浩特市",
              "PCode": 150000000000
            },
            {
              "Code": 150200000000,
              "Name": "包头市",
              "PCode": 150000000000
            },
            {
              "Code": 150300000000,
              "Name": "乌海市",
              "PCode": 150000000000
            },
            {
              "Code": 150400000000,
              "Name": "赤峰市",
              "PCode": 150000000000
            },
            {
              "Code": 150500000000,
              "Name": "通辽市",
              "PCode": 150000000000
            },
            {
              "Code": 150600000000,
              "Name": "鄂尔多斯市",
              "PCode": 150000000000
            },
            {
              "Code": 150700000000,
              "Name": "呼伦贝尔市",
              "PCode": 150000000000
            },
            {
              "Code": 150800000000,
              "Name": "巴彦淖尔市",
              "PCode": 150000000000
            },
            {
              "Code": 150900000000,
              "Name": "乌兰察布市",
              "PCode": 150000000000
            },
            {
              "Code": 152200000000,
              "Name": "兴安盟",
              "PCode": 150000000000
            },
            {
              "Code": 152500000000,
              "Name": "锡林郭勒盟",
              "PCode": 150000000000
            },
            {
              "Code": 152900000000,
              "Name": "阿拉善盟",
              "PCode": 150000000000
            }
          ]
        },
        {
          "Code": 210000000000,
          "PCode": 0,
          "Name": "辽宁省",
          "Childs": [
            {
              "Code": 210100000000,
              "Name": "沈阳市",
              "PCode": 210000000000
            },
            {
              "Code": 210200000000,
              "Name": "大连市",
              "PCode": 210000000000
            },
            {
              "Code": 210300000000,
              "Name": "鞍山市",
              "PCode": 210000000000
            },
            {
              "Code": 210400000000,
              "Name": "抚顺市",
              "PCode": 210000000000
            },
            {
              "Code": 210500000000,
              "Name": "本溪市",
              "PCode": 210000000000
            },
            {
              "Code": 210600000000,
              "Name": "丹东市",
              "PCode": 210000000000
            },
            {
              "Code": 210700000000,
              "Name": "锦州市",
              "PCode": 210000000000
            },
            {
              "Code": 210800000000,
              "Name": "营口市",
              "PCode": 210000000000
            },
            {
              "Code": 210900000000,
              "Name": "阜新市",
              "PCode": 210000000000
            },
            {
              "Code": 211000000000,
              "Name": "辽阳市",
              "PCode": 210000000000
            },
            {
              "Code": 211100000000,
              "Name": "盘锦市",
              "PCode": 210000000000
            },
            {
              "Code": 211200000000,
              "Name": "铁岭市",
              "PCode": 210000000000
            },
            {
              "Code": 211300000000,
              "Name": "朝阳市",
              "PCode": 210000000000
            },
            {
              "Code": 211400000000,
              "Name": "葫芦岛市",
              "PCode": 210000000000
            }
          ]
        },
        {
          "Code": 220000000000,
          "PCode": 0,
          "Name": "吉林省",
          "Childs": [
            {
              "Code": 220100000000,
              "Name": "长春市",
              "PCode": 220000000000
            },
            {
              "Code": 220200000000,
              "Name": "吉林市",
              "PCode": 220000000000
            },
            {
              "Code": 220300000000,
              "Name": "四平市",
              "PCode": 220000000000
            },
            {
              "Code": 220400000000,
              "Name": "辽源市",
              "PCode": 220000000000
            },
            {
              "Code": 220500000000,
              "Name": "通化市",
              "PCode": 220000000000
            },
            {
              "Code": 220600000000,
              "Name": "白山市",
              "PCode": 220000000000
            },
            {
              "Code": 220700000000,
              "Name": "松原市",
              "PCode": 220000000000
            },
            {
              "Code": 220800000000,
              "Name": "白城市",
              "PCode": 220000000000
            },
            {
              "Code": 222400000000,
              "Name": "延边朝鲜族自治州",
              "PCode": 220000000000
            }
          ]
        },
        {
          "Code": 230000000000,
          "PCode": 0,
          "Name": "黑龙江省",
          "Childs": [
            {
              "Code": 230100000000,
              "Name": "哈尔滨市",
              "PCode": 230000000000
            },
            {
              "Code": 230200000000,
              "Name": "齐齐哈尔市",
              "PCode": 230000000000
            },
            {
              "Code": 230300000000,
              "Name": "鸡西市",
              "PCode": 230000000000
            },
            {
              "Code": 230400000000,
              "Name": "鹤岗市",
              "PCode": 230000000000
            },
            {
              "Code": 230500000000,
              "Name": "双鸭山市",
              "PCode": 230000000000
            },
            {
              "Code": 230600000000,
              "Name": "大庆市",
              "PCode": 230000000000
            },
            {
              "Code": 230700000000,
              "Name": "伊春市",
              "PCode": 230000000000
            },
            {
              "Code": 230800000000,
              "Name": "佳木斯市",
              "PCode": 230000000000
            },
            {
              "Code": 230900000000,
              "Name": "七台河市",
              "PCode": 230000000000
            },
            {
              "Code": 231000000000,
              "Name": "牡丹江市",
              "PCode": 230000000000
            },
            {
              "Code": 231100000000,
              "Name": "黑河市",
              "PCode": 230000000000
            },
            {
              "Code": 231200000000,
              "Name": "绥化市",
              "PCode": 230000000000
            },
            {
              "Code": 232700000000,
              "Name": "大兴安岭地区",
              "PCode": 230000000000
            }
          ]
        },
        {
          "Code": 310000000000,
          "PCode": 0,
          "Name": "上海市",
          "Childs": [
            {
              "Code": 310100000000,
              "Name": "直辖区",
              "PCode": 310000000000
            }
          ]
        },
        {
          "Code": 320000000000,
          "PCode": 0,
          "Name": "江苏省",
          "Childs": [
            {
              "Code": 320100000000,
              "Name": "南京市",
              "PCode": 320000000000
            },
            {
              "Code": 320200000000,
              "Name": "无锡市",
              "PCode": 320000000000
            },
            {
              "Code": 320300000000,
              "Name": "徐州市",
              "PCode": 320000000000
            },
            {
              "Code": 320400000000,
              "Name": "常州市",
              "PCode": 320000000000
            },
            {
              "Code": 320500000000,
              "Name": "苏州市",
              "PCode": 320000000000
            },
            {
              "Code": 320600000000,
              "Name": "南通市",
              "PCode": 320000000000
            },
            {
              "Code": 320700000000,
              "Name": "连云港市",
              "PCode": 320000000000
            },
            {
              "Code": 320800000000,
              "Name": "淮安市",
              "PCode": 320000000000
            },
            {
              "Code": 320900000000,
              "Name": "盐城市",
              "PCode": 320000000000
            },
            {
              "Code": 321000000000,
              "Name": "扬州市",
              "PCode": 320000000000
            },
            {
              "Code": 321100000000,
              "Name": "镇江市",
              "PCode": 320000000000
            },
            {
              "Code": 321200000000,
              "Name": "泰州市",
              "PCode": 320000000000
            },
            {
              "Code": 321300000000,
              "Name": "宿迁市",
              "PCode": 320000000000
            }
          ]
        },
        {
          "Code": 330000000000,
          "PCode": 0,
          "Name": "浙江省",
          "Childs": [
            {
              "Code": 330100000000,
              "Name": "杭州市",
              "PCode": 330000000000
            },
            {
              "Code": 330200000000,
              "Name": "宁波市",
              "PCode": 330000000000
            },
            {
              "Code": 330300000000,
              "Name": "温州市",
              "PCode": 330000000000
            },
            {
              "Code": 330400000000,
              "Name": "嘉兴市",
              "PCode": 330000000000
            },
            {
              "Code": 330500000000,
              "Name": "湖州市",
              "PCode": 330000000000
            },
            {
              "Code": 330600000000,
              "Name": "绍兴市",
              "PCode": 330000000000
            },
            {
              "Code": 330700000000,
              "Name": "金华市",
              "PCode": 330000000000
            },
            {
              "Code": 330800000000,
              "Name": "衢州市",
              "PCode": 330000000000
            },
            {
              "Code": 330900000000,
              "Name": "舟山市",
              "PCode": 330000000000
            },
            {
              "Code": 331000000000,
              "Name": "台州市",
              "PCode": 330000000000
            },
            {
              "Code": 331100000000,
              "Name": "丽水市",
              "PCode": 330000000000
            }
          ]
        },
        {
          "Code": 340000000000,
          "PCode": 0,
          "Name": "安徽省",
          "Childs": [
            {
              "Code": 340100000000,
              "Name": "合肥市",
              "PCode": 340000000000
            },
            {
              "Code": 340200000000,
              "Name": "芜湖市",
              "PCode": 340000000000
            },
            {
              "Code": 340300000000,
              "Name": "蚌埠市",
              "PCode": 340000000000
            },
            {
              "Code": 340400000000,
              "Name": "淮南市",
              "PCode": 340000000000
            },
            {
              "Code": 340500000000,
              "Name": "马鞍山市",
              "PCode": 340000000000
            },
            {
              "Code": 340600000000,
              "Name": "淮北市",
              "PCode": 340000000000
            },
            {
              "Code": 340700000000,
              "Name": "铜陵市",
              "PCode": 340000000000
            },
            {
              "Code": 340800000000,
              "Name": "安庆市",
              "PCode": 340000000000
            },
            {
              "Code": 341000000000,
              "Name": "黄山市",
              "PCode": 340000000000
            },
            {
              "Code": 341100000000,
              "Name": "滁州市",
              "PCode": 340000000000
            },
            {
              "Code": 341200000000,
              "Name": "阜阳市",
              "PCode": 340000000000
            },
            {
              "Code": 341300000000,
              "Name": "宿州市",
              "PCode": 340000000000
            },
            {
              "Code": 341500000000,
              "Name": "六安市",
              "PCode": 340000000000
            },
            {
              "Code": 341600000000,
              "Name": "亳州市",
              "PCode": 340000000000
            },
            {
              "Code": 341700000000,
              "Name": "池州市",
              "PCode": 340000000000
            },
            {
              "Code": 341800000000,
              "Name": "宣城市",
              "PCode": 340000000000
            }
          ]
        },
        {
          "Code": 350000000000,
          "PCode": 0,
          "Name": "福建省",
          "Childs": [
            {
              "Code": 350100000000,
              "Name": "福州市",
              "PCode": 350000000000
            },
            {
              "Code": 350200000000,
              "Name": "厦门市",
              "PCode": 350000000000
            },
            {
              "Code": 350300000000,
              "Name": "莆田市",
              "PCode": 350000000000
            },
            {
              "Code": 350400000000,
              "Name": "三明市",
              "PCode": 350000000000
            },
            {
              "Code": 350500000000,
              "Name": "泉州市",
              "PCode": 350000000000
            },
            {
              "Code": 350600000000,
              "Name": "漳州市",
              "PCode": 350000000000
            },
            {
              "Code": 350700000000,
              "Name": "南平市",
              "PCode": 350000000000
            },
            {
              "Code": 350800000000,
              "Name": "龙岩市",
              "PCode": 350000000000
            },
            {
              "Code": 350900000000,
              "Name": "宁德市",
              "PCode": 350000000000
            }
          ]
        },
        {
          "Code": 360000000000,
          "PCode": 0,
          "Name": "江西省",
          "Childs": [
            {
              "Code": 360100000000,
              "Name": "南昌市",
              "PCode": 360000000000
            },
            {
              "Code": 360200000000,
              "Name": "景德镇市",
              "PCode": 360000000000
            },
            {
              "Code": 360300000000,
              "Name": "萍乡市",
              "PCode": 360000000000
            },
            {
              "Code": 360400000000,
              "Name": "九江市",
              "PCode": 360000000000
            },
            {
              "Code": 360500000000,
              "Name": "新余市",
              "PCode": 360000000000
            },
            {
              "Code": 360600000000,
              "Name": "鹰潭市",
              "PCode": 360000000000
            },
            {
              "Code": 360700000000,
              "Name": "赣州市",
              "PCode": 360000000000
            },
            {
              "Code": 360800000000,
              "Name": "吉安市",
              "PCode": 360000000000
            },
            {
              "Code": 360900000000,
              "Name": "宜春市",
              "PCode": 360000000000
            },
            {
              "Code": 361000000000,
              "Name": "抚州市",
              "PCode": 360000000000
            },
            {
              "Code": 361100000000,
              "Name": "上饶市",
              "PCode": 360000000000
            }
          ]
        },
        {
          "Code": 370000000000,
          "PCode": 0,
          "Name": "山东省",
          "Childs": [
            {
              "Code": 370100000000,
              "Name": "济南市",
              "PCode": 370000000000
            },
            {
              "Code": 370200000000,
              "Name": "青岛市",
              "PCode": 370000000000
            },
            {
              "Code": 370300000000,
              "Name": "淄博市",
              "PCode": 370000000000
            },
            {
              "Code": 370400000000,
              "Name": "枣庄市",
              "PCode": 370000000000
            },
            {
              "Code": 370500000000,
              "Name": "东营市",
              "PCode": 370000000000
            },
            {
              "Code": 370600000000,
              "Name": "烟台市",
              "PCode": 370000000000
            },
            {
              "Code": 370700000000,
              "Name": "潍坊市",
              "PCode": 370000000000
            },
            {
              "Code": 370800000000,
              "Name": "济宁市",
              "PCode": 370000000000
            },
            {
              "Code": 370900000000,
              "Name": "泰安市",
              "PCode": 370000000000
            },
            {
              "Code": 371000000000,
              "Name": "威海市",
              "PCode": 370000000000
            },
            {
              "Code": 371100000000,
              "Name": "日照市",
              "PCode": 370000000000
            },
            {
              "Code": 371200000000,
              "Name": "莱芜市",
              "PCode": 370000000000
            },
            {
              "Code": 371300000000,
              "Name": "临沂市",
              "PCode": 370000000000
            },
            {
              "Code": 371400000000,
              "Name": "德州市",
              "PCode": 370000000000
            },
            {
              "Code": 371500000000,
              "Name": "聊城市",
              "PCode": 370000000000
            },
            {
              "Code": 371600000000,
              "Name": "滨州市",
              "PCode": 370000000000
            },
            {
              "Code": 371700000000,
              "Name": "菏泽市",
              "PCode": 370000000000
            }
          ]
        },
        {
          "Code": 410000000000,
          "PCode": 0,
          "Name": "河南省",
          "Childs": [
            {
              "Code": 410100000000,
              "Name": "郑州市",
              "PCode": 410000000000
            },
            {
              "Code": 410200000000,
              "Name": "开封市",
              "PCode": 410000000000
            },
            {
              "Code": 410300000000,
              "Name": "洛阳市",
              "PCode": 410000000000
            },
            {
              "Code": 410400000000,
              "Name": "平顶山市",
              "PCode": 410000000000
            },
            {
              "Code": 410500000000,
              "Name": "安阳市",
              "PCode": 410000000000
            },
            {
              "Code": 410600000000,
              "Name": "鹤壁市",
              "PCode": 410000000000
            },
            {
              "Code": 410700000000,
              "Name": "新乡市",
              "PCode": 410000000000
            },
            {
              "Code": 410800000000,
              "Name": "焦作市",
              "PCode": 410000000000
            },
            {
              "Code": 410900000000,
              "Name": "濮阳市",
              "PCode": 410000000000
            },
            {
              "Code": 411000000000,
              "Name": "许昌市",
              "PCode": 410000000000
            },
            {
              "Code": 411100000000,
              "Name": "漯河市",
              "PCode": 410000000000
            },
            {
              "Code": 411200000000,
              "Name": "三门峡市",
              "PCode": 410000000000
            },
            {
              "Code": 411300000000,
              "Name": "南阳市",
              "PCode": 410000000000
            },
            {
              "Code": 411400000000,
              "Name": "商丘市",
              "PCode": 410000000000
            },
            {
              "Code": 411500000000,
              "Name": "信阳市",
              "PCode": 410000000000
            },
            {
              "Code": 411600000000,
              "Name": "周口市",
              "PCode": 410000000000
            },
            {
              "Code": 411700000000,
              "Name": "驻马店市",
              "PCode": 410000000000
            },
            {
              "Code": 419000000000,
              "Name": "直辖县",
              "PCode": 410000000000
            }
          ]
        },
        {
          "Code": 420000000000,
          "PCode": 0,
          "Name": "湖北省",
          "Childs": [
            {
              "Code": 420100000000,
              "Name": "武汉市",
              "PCode": 420000000000
            },
            {
              "Code": 420200000000,
              "Name": "黄石市",
              "PCode": 420000000000
            },
            {
              "Code": 420300000000,
              "Name": "十堰市",
              "PCode": 420000000000
            },
            {
              "Code": 420500000000,
              "Name": "宜昌市",
              "PCode": 420000000000
            },
            {
              "Code": 420600000000,
              "Name": "襄阳市",
              "PCode": 420000000000
            },
            {
              "Code": 420700000000,
              "Name": "鄂州市",
              "PCode": 420000000000
            },
            {
              "Code": 420800000000,
              "Name": "荆门市",
              "PCode": 420000000000
            },
            {
              "Code": 420900000000,
              "Name": "孝感市",
              "PCode": 420000000000
            },
            {
              "Code": 421000000000,
              "Name": "荆州市",
              "PCode": 420000000000
            },
            {
              "Code": 421100000000,
              "Name": "黄冈市",
              "PCode": 420000000000
            },
            {
              "Code": 421200000000,
              "Name": "咸宁市",
              "PCode": 420000000000
            },
            {
              "Code": 421300000000,
              "Name": "随州市",
              "PCode": 420000000000
            },
            {
              "Code": 422800000000,
              "Name": "恩施土家族苗族自治州",
              "PCode": 420000000000
            },
            {
              "Code": 429000000000,
              "Name": "直辖县",
              "PCode": 420000000000
            }
          ]
        },
        {
          "Code": 430000000000,
          "PCode": 0,
          "Name": "湖南省",
          "Childs": [
            {
              "Code": 430100000000,
              "Name": "长沙市",
              "PCode": 430000000000
            },
            {
              "Code": 430200000000,
              "Name": "株洲市",
              "PCode": 430000000000
            },
            {
              "Code": 430300000000,
              "Name": "湘潭市",
              "PCode": 430000000000
            },
            {
              "Code": 430400000000,
              "Name": "衡阳市",
              "PCode": 430000000000
            },
            {
              "Code": 430500000000,
              "Name": "邵阳市",
              "PCode": 430000000000
            },
            {
              "Code": 430600000000,
              "Name": "岳阳市",
              "PCode": 430000000000
            },
            {
              "Code": 430700000000,
              "Name": "常德市",
              "PCode": 430000000000
            },
            {
              "Code": 430800000000,
              "Name": "张家界市",
              "PCode": 430000000000
            },
            {
              "Code": 430900000000,
              "Name": "益阳市",
              "PCode": 430000000000
            },
            {
              "Code": 431000000000,
              "Name": "郴州市",
              "PCode": 430000000000
            },
            {
              "Code": 431100000000,
              "Name": "永州市",
              "PCode": 430000000000
            },
            {
              "Code": 431200000000,
              "Name": "怀化市",
              "PCode": 430000000000
            },
            {
              "Code": 431300000000,
              "Name": "娄底市",
              "PCode": 430000000000
            },
            {
              "Code": 433100000000,
              "Name": "湘西土家族苗族自治州",
              "PCode": 430000000000
            }
          ]
        },
        {
          "Code": 440000000000,
          "PCode": 0,
          "Name": "广东省",
          "Childs": [
            {
              "Code": 440100000000,
              "Name": "广州市",
              "PCode": 440000000000
            },
            {
              "Code": 440200000000,
              "Name": "韶关市",
              "PCode": 440000000000
            },
            {
              "Code": 440300000000,
              "Name": "深圳市",
              "PCode": 440000000000
            },
            {
              "Code": 440400000000,
              "Name": "珠海市",
              "PCode": 440000000000
            },
            {
              "Code": 440500000000,
              "Name": "汕头市",
              "PCode": 440000000000
            },
            {
              "Code": 440600000000,
              "Name": "佛山市",
              "PCode": 440000000000
            },
            {
              "Code": 440700000000,
              "Name": "江门市",
              "PCode": 440000000000
            },
            {
              "Code": 440800000000,
              "Name": "湛江市",
              "PCode": 440000000000
            },
            {
              "Code": 440900000000,
              "Name": "茂名市",
              "PCode": 440000000000
            },
            {
              "Code": 441200000000,
              "Name": "肇庆市",
              "PCode": 440000000000
            },
            {
              "Code": 441300000000,
              "Name": "惠州市",
              "PCode": 440000000000
            },
            {
              "Code": 441400000000,
              "Name": "梅州市",
              "PCode": 440000000000
            },
            {
              "Code": 441500000000,
              "Name": "汕尾市",
              "PCode": 440000000000
            },
            {
              "Code": 441600000000,
              "Name": "河源市",
              "PCode": 440000000000
            },
            {
              "Code": 441700000000,
              "Name": "阳江市",
              "PCode": 440000000000
            },
            {
              "Code": 441800000000,
              "Name": "清远市",
              "PCode": 440000000000
            },
            {
              "Code": 441900000000,
              "Name": "东莞市",
              "PCode": 440000000000
            },
            {
              "Code": 442000000000,
              "Name": "中山市",
              "PCode": 440000000000
            },
            {
              "Code": 445100000000,
              "Name": "潮州市",
              "PCode": 440000000000
            },
            {
              "Code": 445200000000,
              "Name": "揭阳市",
              "PCode": 440000000000
            },
            {
              "Code": 445300000000,
              "Name": "云浮市",
              "PCode": 440000000000
            }
          ]
        },
        {
          "Code": 450000000000,
          "PCode": 0,
          "Name": "广西壮族自治区",
          "Childs": [
            {
              "Code": 450100000000,
              "Name": "南宁市",
              "PCode": 450000000000
            },
            {
              "Code": 450200000000,
              "Name": "柳州市",
              "PCode": 450000000000
            },
            {
              "Code": 450300000000,
              "Name": "桂林市",
              "PCode": 450000000000
            },
            {
              "Code": 450400000000,
              "Name": "梧州市",
              "PCode": 450000000000
            },
            {
              "Code": 450500000000,
              "Name": "北海市",
              "PCode": 450000000000
            },
            {
              "Code": 450600000000,
              "Name": "防城港市",
              "PCode": 450000000000
            },
            {
              "Code": 450700000000,
              "Name": "钦州市",
              "PCode": 450000000000
            },
            {
              "Code": 450800000000,
              "Name": "贵港市",
              "PCode": 450000000000
            },
            {
              "Code": 450900000000,
              "Name": "玉林市",
              "PCode": 450000000000
            },
            {
              "Code": 451000000000,
              "Name": "百色市",
              "PCode": 450000000000
            },
            {
              "Code": 451100000000,
              "Name": "贺州市",
              "PCode": 450000000000
            },
            {
              "Code": 451200000000,
              "Name": "河池市",
              "PCode": 450000000000
            },
            {
              "Code": 451300000000,
              "Name": "来宾市",
              "PCode": 450000000000
            },
            {
              "Code": 451400000000,
              "Name": "崇左市",
              "PCode": 450000000000
            }
          ]
        },
        {
          "Code": 460000000000,
          "PCode": 0,
          "Name": "海南省",
          "Childs": [
            {
              "Code": 460100000000,
              "Name": "海口市",
              "PCode": 460000000000
            },
            {
              "Code": 460200000000,
              "Name": "三亚市",
              "PCode": 460000000000
            },
            {
              "Code": 460300000000,
              "Name": "三沙市",
              "PCode": 460000000000
            },
            {
              "Code": 460400000000,
              "Name": "儋州市",
              "PCode": 460000000000
            },
            {
              "Code": 469000000000,
              "Name": "直辖县",
              "PCode": 460000000000
            }
          ]
        },
        {
          "Code": 500000000000,
          "PCode": 0,
          "Name": "重庆市",
          "Childs": [
            {
              "Code": 500100000000,
              "Name": "直辖区",
              "PCode": 500000000000
            },
            {
              "Code": 500200000000,
              "Name": "直辖县",
              "PCode": 500000000000
            }
          ]
        },
        {
          "Code": 510000000000,
          "PCode": 0,
          "Name": "四川省",
          "Childs": [
            {
              "Code": 510100000000,
              "Name": "成都市",
              "PCode": 510000000000
            },
            {
              "Code": 510300000000,
              "Name": "自贡市",
              "PCode": 510000000000
            },
            {
              "Code": 510400000000,
              "Name": "攀枝花市",
              "PCode": 510000000000
            },
            {
              "Code": 510500000000,
              "Name": "泸州市",
              "PCode": 510000000000
            },
            {
              "Code": 510600000000,
              "Name": "德阳市",
              "PCode": 510000000000
            },
            {
              "Code": 510700000000,
              "Name": "绵阳市",
              "PCode": 510000000000
            },
            {
              "Code": 510800000000,
              "Name": "广元市",
              "PCode": 510000000000
            },
            {
              "Code": 510900000000,
              "Name": "遂宁市",
              "PCode": 510000000000
            },
            {
              "Code": 511000000000,
              "Name": "内江市",
              "PCode": 510000000000
            },
            {
              "Code": 511100000000,
              "Name": "乐山市",
              "PCode": 510000000000
            },
            {
              "Code": 511300000000,
              "Name": "南充市",
              "PCode": 510000000000
            },
            {
              "Code": 511400000000,
              "Name": "眉山市",
              "PCode": 510000000000
            },
            {
              "Code": 511500000000,
              "Name": "宜宾市",
              "PCode": 510000000000
            },
            {
              "Code": 511600000000,
              "Name": "广安市",
              "PCode": 510000000000
            },
            {
              "Code": 511700000000,
              "Name": "达州市",
              "PCode": 510000000000
            },
            {
              "Code": 511800000000,
              "Name": "雅安市",
              "PCode": 510000000000
            },
            {
              "Code": 511900000000,
              "Name": "巴中市",
              "PCode": 510000000000
            },
            {
              "Code": 512000000000,
              "Name": "资阳市",
              "PCode": 510000000000
            },
            {
              "Code": 513200000000,
              "Name": "阿坝藏族羌族自治州",
              "PCode": 510000000000
            },
            {
              "Code": 513300000000,
              "Name": "甘孜藏族自治州",
              "PCode": 510000000000
            },
            {
              "Code": 513400000000,
              "Name": "凉山彝族自治州",
              "PCode": 510000000000
            }
          ]
        },
        {
          "Code": 520000000000,
          "PCode": 0,
          "Name": "贵州省",
          "Childs": [
            {
              "Code": 520100000000,
              "Name": "贵阳市",
              "PCode": 520000000000
            },
            {
              "Code": 520200000000,
              "Name": "六盘水市",
              "PCode": 520000000000
            },
            {
              "Code": 520300000000,
              "Name": "遵义市",
              "PCode": 520000000000
            },
            {
              "Code": 520400000000,
              "Name": "安顺市",
              "PCode": 520000000000
            },
            {
              "Code": 520500000000,
              "Name": "毕节市",
              "PCode": 520000000000
            },
            {
              "Code": 520600000000,
              "Name": "铜仁市",
              "PCode": 520000000000
            },
            {
              "Code": 522300000000,
              "Name": "黔西南布依族苗族自治州",
              "PCode": 520000000000
            },
            {
              "Code": 522600000000,
              "Name": "黔东南苗族侗族自治州",
              "PCode": 520000000000
            },
            {
              "Code": 522700000000,
              "Name": "黔南布依族苗族自治州",
              "PCode": 520000000000
            }
          ]
        },
        {
          "Code": 530000000000,
          "PCode": 0,
          "Name": "云南省",
          "Childs": [
            {
              "Code": 530100000000,
              "Name": "昆明市",
              "PCode": 530000000000
            },
            {
              "Code": 530300000000,
              "Name": "曲靖市",
              "PCode": 530000000000
            },
            {
              "Code": 530400000000,
              "Name": "玉溪市",
              "PCode": 530000000000
            },
            {
              "Code": 530500000000,
              "Name": "保山市",
              "PCode": 530000000000
            },
            {
              "Code": 530600000000,
              "Name": "昭通市",
              "PCode": 530000000000
            },
            {
              "Code": 530700000000,
              "Name": "丽江市",
              "PCode": 530000000000
            },
            {
              "Code": 530800000000,
              "Name": "普洱市",
              "PCode": 530000000000
            },
            {
              "Code": 530900000000,
              "Name": "临沧市",
              "PCode": 530000000000
            },
            {
              "Code": 532300000000,
              "Name": "楚雄彝族自治州",
              "PCode": 530000000000
            },
            {
              "Code": 532500000000,
              "Name": "红河哈尼族彝族自治州",
              "PCode": 530000000000
            },
            {
              "Code": 532600000000,
              "Name": "文山壮族苗族自治州",
              "PCode": 530000000000
            },
            {
              "Code": 532800000000,
              "Name": "西双版纳傣族自治州",
              "PCode": 530000000000
            },
            {
              "Code": 532900000000,
              "Name": "大理白族自治州",
              "PCode": 530000000000
            },
            {
              "Code": 533100000000,
              "Name": "德宏傣族景颇族自治州",
              "PCode": 530000000000
            },
            {
              "Code": 533300000000,
              "Name": "怒江傈僳族自治州",
              "PCode": 530000000000
            },
            {
              "Code": 533400000000,
              "Name": "迪庆藏族自治州",
              "PCode": 530000000000
            }
          ]
        },
        {
          "Code": 540000000000,
          "PCode": 0,
          "Name": "西藏自治区",
          "Childs": [
            {
              "Code": 540100000000,
              "Name": "拉萨市",
              "PCode": 540000000000
            },
            {
              "Code": 540200000000,
              "Name": "日喀则市",
              "PCode": 540000000000
            },
            {
              "Code": 540300000000,
              "Name": "昌都市",
              "PCode": 540000000000
            },
            {
              "Code": 540400000000,
              "Name": "林芝市",
              "PCode": 540000000000
            },
            {
              "Code": 540500000000,
              "Name": "山南市",
              "PCode": 540000000000
            },
            {
              "Code": 542400000000,
              "Name": "那曲地区",
              "PCode": 540000000000
            },
            {
              "Code": 542500000000,
              "Name": "阿里地区",
              "PCode": 540000000000
            }
          ]
        },
        {
          "Code": 610000000000,
          "PCode": 0,
          "Name": "陕西省",
          "Childs": [
            {
              "Code": 610100000000,
              "Name": "西安市",
              "PCode": 610000000000
            },
            {
              "Code": 610200000000,
              "Name": "铜川市",
              "PCode": 610000000000
            },
            {
              "Code": 610300000000,
              "Name": "宝鸡市",
              "PCode": 610000000000
            },
            {
              "Code": 610400000000,
              "Name": "咸阳市",
              "PCode": 610000000000
            },
            {
              "Code": 610500000000,
              "Name": "渭南市",
              "PCode": 610000000000
            },
            {
              "Code": 610600000000,
              "Name": "延安市",
              "PCode": 610000000000
            },
            {
              "Code": 610700000000,
              "Name": "汉中市",
              "PCode": 610000000000
            },
            {
              "Code": 610800000000,
              "Name": "榆林市",
              "PCode": 610000000000
            },
            {
              "Code": 610900000000,
              "Name": "安康市",
              "PCode": 610000000000
            },
            {
              "Code": 611000000000,
              "Name": "商洛市",
              "PCode": 610000000000
            }
          ]
        },
        {
          "Code": 620000000000,
          "PCode": 0,
          "Name": "甘肃省",
          "Childs": [
            {
              "Code": 620100000000,
              "Name": "兰州市",
              "PCode": 620000000000
            },
            {
              "Code": 620200000000,
              "Name": "嘉峪关市",
              "PCode": 620000000000
            },
            {
              "Code": 620300000000,
              "Name": "金昌市",
              "PCode": 620000000000
            },
            {
              "Code": 620400000000,
              "Name": "白银市",
              "PCode": 620000000000
            },
            {
              "Code": 620500000000,
              "Name": "天水市",
              "PCode": 620000000000
            },
            {
              "Code": 620600000000,
              "Name": "武威市",
              "PCode": 620000000000
            },
            {
              "Code": 620700000000,
              "Name": "张掖市",
              "PCode": 620000000000
            },
            {
              "Code": 620800000000,
              "Name": "平凉市",
              "PCode": 620000000000
            },
            {
              "Code": 620900000000,
              "Name": "酒泉市",
              "PCode": 620000000000
            },
            {
              "Code": 621000000000,
              "Name": "庆阳市",
              "PCode": 620000000000
            },
            {
              "Code": 621100000000,
              "Name": "定西市",
              "PCode": 620000000000
            },
            {
              "Code": 621200000000,
              "Name": "陇南市",
              "PCode": 620000000000
            },
            {
              "Code": 622900000000,
              "Name": "临夏回族自治州",
              "PCode": 620000000000
            },
            {
              "Code": 623000000000,
              "Name": "甘南藏族自治州",
              "PCode": 620000000000
            }
          ]
        },
        {
          "Code": 630000000000,
          "PCode": 0,
          "Name": "青海省",
          "Childs": [
            {
              "Code": 630100000000,
              "Name": "西宁市",
              "PCode": 630000000000
            },
            {
              "Code": 630200000000,
              "Name": "海东市",
              "PCode": 630000000000
            },
            {
              "Code": 632200000000,
              "Name": "海北藏族自治州",
              "PCode": 630000000000
            },
            {
              "Code": 632300000000,
              "Name": "黄南藏族自治州",
              "PCode": 630000000000
            },
            {
              "Code": 632500000000,
              "Name": "海南藏族自治州",
              "PCode": 630000000000
            },
            {
              "Code": 632600000000,
              "Name": "果洛藏族自治州",
              "PCode": 630000000000
            },
            {
              "Code": 632700000000,
              "Name": "玉树藏族自治州",
              "PCode": 630000000000
            },
            {
              "Code": 632800000000,
              "Name": "海西蒙古族藏族自治州",
              "PCode": 630000000000
            }
          ]
        },
        {
          "Code": 640000000000,
          "PCode": 0,
          "Name": "宁夏回族自治区",
          "Childs": [
            {
              "Code": 640100000000,
              "Name": "银川市",
              "PCode": 640000000000
            },
            {
              "Code": 640200000000,
              "Name": "石嘴山市",
              "PCode": 640000000000
            },
            {
              "Code": 640300000000,
              "Name": "吴忠市",
              "PCode": 640000000000
            },
            {
              "Code": 640400000000,
              "Name": "固原市",
              "PCode": 640000000000
            },
            {
              "Code": 640500000000,
              "Name": "中卫市",
              "PCode": 640000000000
            }
          ]
        },
        {
          "Code": 650000000000,
          "PCode": 0,
          "Name": "新疆维吾尔自治区",
          "Childs": [
            {
              "Code": 650100000000,
              "Name": "乌鲁木齐市",
              "PCode": 650000000000
            },
            {
              "Code": 650200000000,
              "Name": "克拉玛依市",
              "PCode": 650000000000
            },
            {
              "Code": 650400000000,
              "Name": "吐鲁番市",
              "PCode": 650000000000
            },
            {
              "Code": 650500000000,
              "Name": "哈密市",
              "PCode": 650000000000
            },
            {
              "Code": 652300000000,
              "Name": "昌吉回族自治州",
              "PCode": 650000000000
            },
            {
              "Code": 652700000000,
              "Name": "博尔塔拉蒙古自治州",
              "PCode": 650000000000
            },
            {
              "Code": 652800000000,
              "Name": "巴音郭楞蒙古自治州",
              "PCode": 650000000000
            },
            {
              "Code": 652900000000,
              "Name": "阿克苏地区",
              "PCode": 650000000000
            },
            {
              "Code": 653000000000,
              "Name": "克孜勒苏柯尔克孜自治州",
              "PCode": 650000000000
            },
            {
              "Code": 653100000000,
              "Name": "喀什地区",
              "PCode": 650000000000
            },
            {
              "Code": 653200000000,
              "Name": "和田地区",
              "PCode": 650000000000
            },
            {
              "Code": 654000000000,
              "Name": "伊犁哈萨克自治州",
              "PCode": 650000000000
            },
            {
              "Code": 654200000000,
              "Name": "塔城地区",
              "PCode": 650000000000
            },
            {
              "Code": 654300000000,
              "Name": "阿勒泰地区",
              "PCode": 650000000000
            },
            {
              "Code": 659000000000,
              "Name": "直辖县",
              "PCode": 650000000000
            }
          ]
        }
      ],
      selectedCode: [],
      selectedCityCode: [],
    }
  },
  watch: {
    all: {
      handler: function (v) {
        console.log(v);
        if (v) {
          let arr = []
          let arr1 = []
          this.data.forEach(item => {
            arr.push(item.Code)
            if (item.Childs && item.Childs.length) {
              item.Childs.forEach(obj => {
                arr1.push(obj.Code)
              })
            }
          })
          this.selectedCode = arr;
          this.selectedCityCode = arr1;
        } else {
          this.selectedCode = [];
          this.selectedCityCode = []
        }
      }
    }
  }
}
</script>

<style>
</style>
